MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMS70Q20A/mcu.h
  PERIPH_COUNT_IRQn        = 69  /**< Number of peripheral IDs */
} IRQn_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* Cortex-M handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset  */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted  */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault     */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match  */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault  */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition  */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction  */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor                        */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service  */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer                    */


  /* Peripheral handlers */
  void* pfnSUPC_Handler;                         /* 0   SAMS70Q20 Supply Controller (SUPC) */
  void* pfnRSTC_Handler;                         /* 1   SAMS70Q20 Reset Controller (RSTC) */
  void* pfnRTC_Handler;                          /* 2   SAMS70Q20 Real-time Clock (RTC) */
  void* pfnRTT_Handler;                          /* 3   SAMS70Q20 Real-time Timer (RTT) */
  void* pfnWDT_Handler;                          /* 4   SAMS70Q20 Watchdog Timer (WDT) */
  void* pfnPMC_Handler;                          /* 5   SAMS70Q20 Power Management Controller (PMC) */
  void* pfnEFC_Handler;                          /* 6   SAMS70Q20 Embedded Flash Controller (EFC) */
  void* pfnUART0_Handler;                        /* 7   SAMS70Q20 Universal Asynchronous Receiver Transmitter (UART0) */
  void* pfnUART1_Handler;                        /* 8   SAMS70Q20 Universal Asynchronous Receiver Transmitter (UART1) */
  void* pvReserved9;
  void* pfnPIOA_Handler;                         /* 10  SAMS70Q20 Parallel Input/Output Controller (PIOA) */
  void* pfnPIOB_Handler;                         /* 11  SAMS70Q20 Parallel Input/Output Controller (PIOB) */
  void* pfnPIOC_Handler;                         /* 12  SAMS70Q20 Parallel Input/Output Controller (PIOC) */
  void* pfnUSART0_Handler;                       /* 13  SAMS70Q20 Universal Synchronous Asynchronous Receiver Transmitter (USART0) */
  void* pfnUSART1_Handler;                       /* 14  SAMS70Q20 Universal Synchronous Asynchronous Receiver Transmitter (USART1) */
  void* pfnUSART2_Handler;                       /* 15  SAMS70Q20 Universal Synchronous Asynchronous Receiver Transmitter (USART2) */
  void* pfnPIOD_Handler;                         /* 16  SAMS70Q20 Parallel Input/Output Controller (PIOD) */
  void* pfnPIOE_Handler;                         /* 17  SAMS70Q20 Parallel Input/Output Controller (PIOE) */
  void* pfnHSMCI_Handler;                        /* 18  SAMS70Q20 High Speed MultiMedia Card Interface (HSMCI) */
  void* pfnTWIHS0_Handler;                       /* 19  SAMS70Q20 Two-wire Interface High Speed (TWIHS0) */
  void* pfnTWIHS1_Handler;                       /* 20  SAMS70Q20 Two-wire Interface High Speed (TWIHS1) */
  void* pfnSPI0_Handler;                         /* 21  SAMS70Q20 Serial Peripheral Interface (SPI0) */
  void* pfnSSC_Handler;                          /* 22  SAMS70Q20 Synchronous Serial Controller (SSC) */
  void* pfnTC0_Handler;                          /* 23  SAMS70Q20 Timer Counter (TC0)  */
  void* pfnTC1_Handler;                          /* 24  SAMS70Q20 Timer Counter (TC0)  */
  void* pfnTC2_Handler;                          /* 25  SAMS70Q20 Timer Counter (TC0)  */
  void* pfnTC3_Handler;                          /* 26  SAMS70Q20 Timer Counter (TC1)  */
  void* pfnTC4_Handler;                          /* 27  SAMS70Q20 Timer Counter (TC1)  */
  void* pfnTC5_Handler;                          /* 28  SAMS70Q20 Timer Counter (TC1)  */
  void* pfnAFEC0_Handler;                        /* 29  SAMS70Q20 Analog Front-End Controller (AFEC0) */
  void* pfnDACC_Handler;                         /* 30  SAMS70Q20 Digital-to-Analog Converter Controller (DACC) */
  void* pfnPWM0_Handler;                         /* 31  SAMS70Q20 Pulse Width Modulation Controller (PWM0) */
  void* pfnICM_Handler;                          /* 32  SAMS70Q20 Integrity Check Monitor (ICM) */
  void* pfnACC_Handler;                          /* 33  SAMS70Q20 Analog Comparator Controller (ACC) */
  void* pfnUSBHS_Handler;                        /* 34  SAMS70Q20 USB High-Speed Interface (USBHS) */
  void* pvReserved35;
  void* pvReserved36;
  void* pvReserved37;
  void* pvReserved38;
  void* pvReserved39;
  void* pfnAFEC1_Handler;                        /* 40  SAMS70Q20 Analog Front-End Controller (AFEC1) */
  void* pfnTWIHS2_Handler;                       /* 41  SAMS70Q20 Two-wire Interface High Speed (TWIHS2) */
  void* pfnSPI1_Handler;                         /* 42  SAMS70Q20 Serial Peripheral Interface (SPI1) */
  void* pfnQSPI_Handler;                         /* 43  SAMS70Q20 Quad Serial Peripheral Interface (QSPI) */
  void* pfnUART2_Handler;                        /* 44  SAMS70Q20 Universal Asynchronous Receiver Transmitter (UART2) */
  void* pfnUART3_Handler;                        /* 45  SAMS70Q20 Universal Asynchronous Receiver Transmitter (UART3) */
  void* pfnUART4_Handler;                        /* 46  SAMS70Q20 Universal Asynchronous Receiver Transmitter (UART4) */
  void* pfnTC6_Handler;                          /* 47  SAMS70Q20 Timer Counter (TC2)  */
  void* pfnTC7_Handler;                          /* 48  SAMS70Q20 Timer Counter (TC2)  */
  void* pfnTC8_Handler;                          /* 49  SAMS70Q20 Timer Counter (TC2)  */
  void* pfnTC9_Handler;                          /* 50  SAMS70Q20 Timer Counter (TC3)  */
  void* pfnTC10_Handler;                         /* 51  SAMS70Q20 Timer Counter (TC3)  */
  void* pfnTC11_Handler;                         /* 52  SAMS70Q20 Timer Counter (TC3)  */
  void* pvReserved53;
  void* pvReserved54;
  void* pvReserved55;
  void* pfnAES_Handler;                          /* 56  SAMS70Q20 Advanced Encryption Standard (AES) */
  void* pfnTRNG_Handler;                         /* 57  SAMS70Q20 True Random Number Generator (TRNG) */
  void* pfnXDMAC_Handler;                        /* 58  SAMS70Q20 Extensible DMA Controller (XDMAC) */
  void* pfnISI_Handler;                          /* 59  SAMS70Q20 Image Sensor Interface (ISI) */
  void* pfnPWM1_Handler;                         /* 60  SAMS70Q20 Pulse Width Modulation Controller (PWM1) */
  void* pfnFPU_Handler;                          /* 61  SAMS70Q20 Floating Point Unit (FPU) */
  void* pfnSDRAMC_Handler;                       /* 62  SAMS70Q20 SDRAM Controller (SDRAMC) */
  void* pfnRSWDT_Handler;                        /* 63  SAMS70Q20 Reinforced Safety Watchdog Timer (RSWDT) */
  void* pvReserved64;
  void* pvReserved65;
  void* pvReserved66;
  void* pvReserved67;
  void* pfnIXC_Handler;                          /* 68  SAMS70Q20 Floating Point Unit (FPU) */
} DeviceVectors;

/* Defines for Deprecated Interrupt and Exceptions handler names */
#define pfnMemManage_Handler      pfnMemoryManagement_Handler     /**< \deprecated  Backward compatibility for ASF */
#define pfnDebugMon_Handler       pfnDebugMonitor_Handler         /**< \deprecated  Backward compatibility for ASF */
#define pfnNMI_Handler            pfnNonMaskableInt_Handler       /**< \deprecated  Backward compatibility for ASF */
#define pfnSVC_Handler            pfnSVCall_Handler               /**< \deprecated  Backward compatibility for ASF */

